In [67]:
import pandas as pd
import numpy as np

In [68]:
rcols=['user_id','movie_id','rating','unix_timestamp']
ratings = pd.read_csv('user based/u.data',sep ='\t',names = rcols,encoding='latin-1')

Replace the rating value 879539614 to 5[highest rating]

In [69]:
ratings['rating'].unique()

array([879539614,         3,         4,         2,         5,         1],
      dtype=int64)

In [70]:
ratings['rating'].replace({879539614:5},inplace = True)

<ipython-input-70-74c6122a81be>:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ratings['rating'].replace({879539614:5},inplace = True)

In [71]:
ratings

       user_id  movie_id  rating  unix_timestamp
0           82         3       5             NaN
1          251       471       3     886272319.0
2          566        31       3     881650825.0
3          637       338       4     882900888.0
4          371         1       4     877487440.0
...        ...       ...     ...             ...
46842      880       476       3     880175444.0
46843      716       204       5     879795543.0
46844      276      1090       1     874795795.0
46845       13       225       2     882399156.0
46846       12       203       3     879959583.0

[46847 rows x 4 columns]

In [72]:
nusers = ratings.user_id.unique().shape[0]
nitems = ratings.movie_id.unique().shape[0]

In [73]:
print('number of users : ',nusers)
print('number of movies : ', nitems)

number of users :  943
number of movies :  1557

# Get the list of movies watched by users by grouping user id and movie id

In [74]:
df = ratings.groupby('user_id')['movie_id'].apply(list).reset_index(name='movie_id')

In [75]:
df

     user_id                                           movie_id
0          1  [127, 16, 79, 261, 45, 48, 25, 251, 195, 153, ...
1          2  [300, 100, 127, 285, 289, 304, 272, 278, 288, ...
2          3                     [325, 347, 336, 353, 340, 346]
3          4                     [324, 359, 362, 358, 360, 301]
4          5  [450, 235, 169, 431, 121, 374, 365, 189, 446, ...
..       ...                                                ...
938      939  [931, 106, 258, 1054, 689, 476, 409, 121, 1190...
939      940  [193, 568, 14, 205, 272, 655, 315, 66, 873, 28...
940      941  [147, 124, 117, 181, 993, 258, 7, 475, 257, 15...
941      942  [117, 200, 604, 423, 261, 427, 487, 323, 615, ...
942      943  [58, 111, 11, 570, 232, 1067, 808, 356, 186, 2...

[943 rows x 2 columns]

In [76]:
movie_list = df['movie_id'].tolist()

# make a single list for all movie id

In [78]:
import itertools
movie_single_list=list(itertools.chain.from_iterable(movie_list))

# count the number of movie id watched by all users

In [79]:
from collections import Counter
movie_count = Counter(movie_single_list)
movie_count
movie_dataframe = pd.DataFrame.from_dict(movie_count, orient='index').reset_index()

In [100]:

movie_data = movie_dataframe.rename(columns={'index':'movie_id', 0:'count'})
movie_data

      movie_id  count
0          127    209
1           16     20
2           79    171
3          261     22
4           45     42
...        ...    ...
1552      1397      1
1553       600      1
1554      1344      1
1555      1370      1
1556      1377      1

[1557 rows x 2 columns]

In [81]:
#Read the movie Dataset
genres = ['unknown', 'Action', 'Adventure','Animation', 'Children\'s', 'Comedy', 
          'Crime', 'Documentary', 'Drama', 'Fantasy','Film-Noir', 'Horror', 
          'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western']
i_cols = ['movie id', 'movie title','release date','video release date', 'IMDb URL']
items = pd.read_csv('user based/u.item', sep='|', names=['movie id', 'movie title','release date','video release date', 'IMDb URL'] + genres,encoding='latin-1')

In [82]:
items

,movie id,movie title,release date,video release date,IMDb URL,unknown,Action,Adventure,Animation,Children's,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1677,1678,Mat' i syn (1997),06-Feb-1998,NaN,http://us.imdb.com/M/title-exact?Mat%27+i+syn+...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1678,1679,B. Monkey (1998),06-Feb-1998,NaN,http://us.imdb.com/M/title-exact?B%2E+Monkey+(...,0,0,0,0,0,...,0,0,0,0,0,1,0,1,0,0
1679,1680,Sliding Doors (1998),01-Jan-1998,NaN,http://us.imdb.com/Title?Sliding+Doors+(1998),0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
1680,1681,You So Crazy (1994),01-Jan-1994,NaN,http://us.imdb.com/M/title-exact?You%20So%20Cr...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1681,1682,Scream of Stone (Schrei aus Stein) (1991),08-Mar-1996,NaN,http://us.imdb.com/M/title-exact?Schrei%20aus%...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [83]:
movie_with_genre = items[['movie id','unknown', 'Action', 'Adventure','Animation', 'Children\'s', 'Comedy', 
          'Crime', 'Documentary', 'Drama', 'Fantasy','Film-Noir', 'Horror', 
          'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western']]
movie_with_genre = pd.DataFrame(movie_with_genre)

In [84]:
movie_with_genre = pd.DataFrame(movie_with_genre)

In [85]:
movie_with_genre

,movie id,unknown,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,2,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0
2,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0
3,4,0,1,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,5,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1677,1678,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
1678,1679,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0
1679,1680,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0
1680,1681,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1681,1682,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0

In [86]:
movie_with_genre.set_index(['movie id'], inplace=True)

In [87]:
movie_genres = dict(
    list(
        movie_with_genre.groupby(movie_with_genre.index)
    )
)

# Add genre column to the movie list

In [88]:
movie_genre_list =[]
for k, v in movie_genres.items():               # k: name of index, v: is a df
    check = v.columns[(v == 1).any()]
    if len(check) > 0:
        movie_genre_list.append((k, check.to_list()))
        #print((k, check.to_list()))

In [89]:
#movie_genre_list

In [90]:
movie_genre = pd.DataFrame(movie_genre_list, columns=['movie_id', 'genre'])

In [91]:
movie_genre

      movie_id                            genre
0            1  [Animation, Children's, Comedy]
1            2    [Action, Adventure, Thriller]
2            3                       [Thriller]
3            4          [Action, Comedy, Drama]
4            5         [Crime, Drama, Thriller]
...        ...                              ...
1677      1678                          [Drama]
1678      1679              [Romance, Thriller]
1679      1680                 [Drama, Romance]
1680      1681                         [Comedy]
1681      1682                          [Drama]

[1682 rows x 2 columns]

In [92]:
# movie_with_several_genres = []
# for _,movie in items.iterrows():
#     if movie[genres].sum() == 1:
#         movie_with_several_genres.append(movie['movie title'])#movie[genres])

# Combine movie data and movie genre dataframe

In [93]:
movie_merged = pd.merge(
   movie_data, movie_genre, how="inner", left_on=['movie_id'], right_on=['movie_id'])

In [94]:
movie_merged1 = pd.merge(movie_merged,items,how = 'inner',left_on=['movie_id'], right_on=['movie id'])

In [95]:
all_movie_data = movie_merged1[['movie_id','count','movie title' ,'genre']]

# convert the list of genre to multiple rows

In [96]:
all_movie_data = all_movie_data.explode('genre')

In [97]:
all_movies_data = pd.merge(all_movie_data,ratings,how = 'inner',left_on=['movie_id'], right_on=['movie_id'])
all_movies_data= all_movies_data[['movie_id','count','movie title','genre','rating']]

In [98]:
all_movies_data = all_movies_data.drop_duplicates()

In [57]:
all_movies_data

,movie_id,count,movie title,genre,rating
0,127,209,"Godfather, The (1972)",Action,4
2,127,209,"Godfather, The (1972)",Action,5
8,127,209,"Godfather, The (1972)",Action,3
47,127,209,"Godfather, The (1972)",Action,1
57,127,209,"Godfather, The (1972)",Action,2
...,...,...,...,...,...
100359,1344,1,"Story of Xinghua, The (1993)",Drama,5
100360,1370,1,I Can't Sleep (J'ai pas sommeil) (1994),Drama,4
100361,1370,1,I Can't Sleep (J'ai pas sommeil) (1994),Thriller,4
100362,1377,1,Hotel de Love (1996),Comedy,5
100363,1377,1,Hotel de Love (1996),Romance,5

group by movie id, count, movie title and genre

In [58]:
all_movies_data_rating = all_movies_data.groupby(['movie_id', 'count','movie title','genre'])['rating'].mean().reset_index()

group by genre and movie title to get the number of times the movie id have appeared

In [64]:
all_movies_genre_group = all_movies_data_rating.groupby(['genre','movie title'])['count'].sum()

In [65]:
all_movies_genre_group

genre    movie title
Action   3 Ninjas: High Noon At Mega Mountain (1998)      1
         Abyss, The (1989)                               66
         Adventures of Robin Hood, The (1938)            26
         African Queen, The (1951)                       75
         Air Force One (1997)                           213
                                                       ...
Western  Wild Bunch, The (1969)                          22
         Wyatt Earp (1994)                               28
         Young Guns (1988)                               54
         Young Guns II (1990)                            21
unknown  unknown                                          2
Name: count, Length: 2690, dtype: int64

In [62]:
result = all_movies_genre_group.to_frame().reset_index()#.drop('level_2', axis=1)
print(result)

        genre                                  movie title  count
0      Action  3 Ninjas: High Noon At Mega Mountain (1998)      1
1      Action                            Abyss, The (1989)     66
2      Action         Adventures of Robin Hood, The (1938)     26
3      Action                    African Queen, The (1951)     75
4      Action                         Air Force One (1997)    213
...       ...                                          ...    ...
2685  Western                       Wild Bunch, The (1969)     22
2686  Western                            Wyatt Earp (1994)     28
2687  Western                            Young Guns (1988)     54
2688  Western                         Young Guns II (1990)     21
2689  unknown                                      unknown      2

[2690 rows x 3 columns]

display the top5 movies for each category based on the number of times the user watched

In [66]:
df1 = result.sort_values('count',ascending = False).groupby(['genre']).head(5)
#print (df1)
top5_category = pd.DataFrame(df1)
top5_category.sort_values(by=['genre', 'count'])

        genre                                movie title  count
92     Action                      Godfather, The (1972)    209
4      Action                       Air Force One (1997)    213
111    Action              Independence Day (ID4) (1996)    222
173    Action                  Return of the Jedi (1983)    248
198    Action                           Star Wars (1977)    282
...       ...                                        ...    ...
2672  Western     Good, The Bad and The Ugly, The (1966)     62
2683  Western                          Unforgiven (1992)     77
2666  Western  Butch Cassidy and the Sundance Kid (1969)     96
2668  Western                  Dances with Wolves (1990)    117
2689  unknown                                    unknown      2

[91 rows x 3 columns]

In [50]:
#result[result['genre']=='Action'].sort_values(by = 'count',ascending=False).head(5)